---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.StirrupTieAttachmentType
source: html/bc9bdd47-9bc4-6d13-7a03-94b568fdad24.htm
---
# Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.StirrupTieAttachmentType Property

Identifies the StirrupTieAttachmentType of the current Rebar element.
 The RebarStyle of the Rebar element must be StirrupTie.

## Syntax (C#)
```csharp
public StirrupTieAttachmentType StirrupTieAttachmentType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration